import codecs

mp = {'2': 'Ա', '3': 'ա', '´': 'Բ', 'µ': 'բ', 'μ': 'բ', '¶': 'Գ', '·': 'գ', '̧': 'Դ', '1': 'դ', 'º': 'Ե', '»': 'ե',
      '¼': 'Զ', '½': 'զ', '¾': 'Է', '¿': 'է', 'À': 'Ը', 'Á': 'ը', 'Â': 'Թ', 'Ã': 'թ', 'Ä': 'Ժ', 'Å': 'ժ', 'Æ': 'Ի',
      'Ç': 'ի', 'È': 'Լ', 'É': 'լ', 'Ê': 'Խ', 'Ë': 'խ', 'Ì': 'Ծ', 'Í': 'ծ', 'Î': 'Կ', 'Ï': 'կ', 'Ð': 'Հ', 'Ñ': 'հ',
      'Ò': 'Ձ', 'Ó': 'ձ', 'Ô': 'Ղ', 'Õ': 'ղ', 'Ö': 'Ճ', '×': 'ճ', 'Ø': 'Մ', 'Ù': 'մ', 'Ú': 'Յ', 'Û': 'յ', 'Ü': 'Ն',
      'Ý': 'ն', 'Þ': 'Շ', 'ß': 'շ', 'à': 'Ո', 'á': 'ո', 'â': 'Չ', 'ã': 'չ', 'ä': 'Պ', 'å': 'պ', 'æ': 'Ջ', 'ç': 'ջ',
      'è': 'Ռ', 'é': 'ռ', 'ê': 'Ս', 'ë': 'ս', 'ì': 'Վ', 'í': 'վ', 'î': 'Տ', 'ï': 'տ', 'ð': 'Ր', 'ñ': 'ր', 'ò': 'Ց',
      'ó': 'ց', 'ô': 'Ւ', 'õ': 'ւ', 'ö': 'Փ', '÷': 'փ', 'ø': 'Ք', 'ù': 'ք', 'ú': 'Օ', 'û': 'օ', 'ü': 'Ֆ', 'ý': 'ֆ',
      ' ̈': 'և', '•': 'գ', '±': '՞', '£': '։', '«': ',', '©': '.', ' ': ' '}

with codecs.open('ansi.txt', 'r', encoding='utf8') as file:
    lines = file.read()
lines1 = 'k' + lines
lines2 = 'kk' + lines
unicode = ''
for i, j, k in zip(lines, lines1, lines2):
    if i == '4' and j == '⁄' and k == '1':
        unicode = unicode[:-2]
        unicode += 'Զ'
    elif i == '2' and j == '⁄' and k == '1':
        unicode = unicode[:-2]
        unicode += 'զ'
    elif i == '4' and j == '⁄' and k == '3':
        unicode = unicode[:-2]
        unicode += 'Է'
    elif i == '̧':
        unicode = unicode[:-1]
        unicode += 'Դ'
    elif i in mp.keys():
        unicode += mp[i]
    else:
        unicode += i
print(unicode)
with codecs.open('unicode.txt', 'w', encoding='utf8') as file:
    unicode1 = file.write(unicode)